Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Выбор пункта "Подключения" в панели навигации
en: Select "Connections" on the navigation bar

source: Выбор режима работы калькулятора
en: Select calculator mode

source: Выбор составного объекта.
en: Select complex object

source: Выбранные поля — делится на группы.
en: Selected fields are divided into groups.

source: Выбранные поля — делится на списки Группа и Показатели.
en: Selected fields are divided into the Group and Parameters lists.

source: Выбранные поля — делится на списки.
en: Selected fields are divided into lists.

source: Выбранные поля — параметры кэширования устанавливаются для каждого поля в отдельности.
en: Selected fields: caching parameters are separately set for each field.

source: Выбранные поля — представляет список результирующих переменных.
en: Selected fields: list of resulting variables.

source: Выбранные элементы — правая часть с уже выбранными элементами, позволяет указать интересуемые элементы из первого и задать им необходимые условия и значения.
en: Selected items are in the right part. It contains already chosen items. It enables to specify the required items in the first one and set necessary conditions and values for them.

source: Выбрать все Выбрать все — выбрать все варианта агрегации со всеми способами отображения;
en: Check all Check all enables to check all aggregation options with all representation methods.

source: Выбрать все Выбрать все — отмечает все строки;
en: Check all Check all enables to check all rows.

source: Выбрать пространство имен — пространство имён элементов и атрибутов, служащее для обеспечения их уникальности в WSDL-описании сервиса.
en: Select namespace: the namespace of items and attributes that provides their uniqueness in WSDL description of the service.

source: Выводить Выводить — определяет будет ли добавлен этот элемент в виде поля в выходной набор данных (если отключено, то поле добавлено не будет, но по нему можно установить фильтр);
en: Show Show enables to define whether this item will be added in the form of a field to the output data set (if it is disabled, the field will not be added but corresponding filter can be set).

source: Выдавать "сырой" ответ сервера — в выходном наборе данных порта Дополнительные данные выводить SOAP-сообщение ответа сервиса.
en: Produce "raw" server response: to show SOAP message of the service response in the output data set of the Additional data port.

source: Выдавать описание кодов завершения — в таблицу с логами будет добавлен столбец "Описание ошибки".
en: Provide description of error codes: "Error description" column will be added to the table with logs.

source: Выдавать описание кодов завершения — отображать описание ошибок, произошедших при отправке запроса, получении и разборе ответа сервиса.
en: Provide description of error codes enables to display description of the errors that occurred while request sending, receipt and parsing of the service response.

source: Выдавать описание кодов завершения — отображать описание ошибок, произошедших при отправке запроса, получении и разборе ответа сервиса;
en: Provide description of error codes enables to display description of the errors that occurred while request sending, receipt and parsing of the service response.

source: Выделение блока узлов.
en: Selection of the Block of Nodes

source: Выделение ячеек — выделить ячейки таблицы.
en: Select cells: select the table cells.

source: Вызов быстрого просмотра.
en: Call Quick View

source: Вызов мастера настройки узла.
en: Call node configuration wizard.

source: Выполнение одной из веток сценария в зависимости от условия.
en: Execution of one of the workflow branches according to the condition.

source: Выполнение узла
en: Node execution

source: Выполнение узла Выполнение узла
en: Node ExecutionNode Execution

source: Выполнить узел и все его подузлы — флаг определяет, будет ли активироваться узел при пакетном запуске Сценария без переобучения (без параметра /Teach).
en: Run node and all its subnodes: the checkbox enables to define whether the node will be activated in the case of the batch Workflow launch without retraining (without /Teach parameter).

source: Выравнивание — позволяет настроить выравнивание значений в ячейках:
en: Alignment enables to configure alignment of values in cells:

source: Выражение
en: Expression

source: Выражение Выражение
en: Expression Expression

source: Выход разгруппировки Выход разгруппировки — исходная таблица после обработки, в нее добавляются следующие поля.
en: Ungroup output Ungroup output: the source table after processing. The following fields are added to it:

source: Выход — закрытие всех Пакетов и выход из приложения;
en: Exit: closure of all Packages and application exit.

source: Выходное дерево данных Дерево данных.
en: Output data tree Data tree.

source: Выходной источник данных Выходной источник данных — порт, отдающий данные после их преобразования в древовидную форму.
en: Output data set Output data set: the port providing data after their transformation to the tree-like form.

source: Выходной источник данных Выходной набор данных — на порт выводится таблица с набором данных дополненным смещенными полями.
en: Output data source Output data set: the table with the data set appended with biased fields is output to the port.

source: Выходной источник данных Выходной набор данных — на порт выводится таблица с обработанными данными.
en: Output data source Output data set: the table with processed data is output to the port.

source: Выходной источник данных Выходной набор данных — на порт выводится таблица с транспонированным набором данных.
en: Output data source Output data set: the table with transposed data set is output to the port.

source: Выходной источник данных Выходной набор данных — порт отдающий сгруппированную таблицу.
en: Output data source Output data set: the port providing the grouped table.

source: Выходной набор данных (OutputTable);
en: Output data set (OutputTable);

source: Выходной набор данных Выходной набор данных (таблица данных).
en: Output data set Output data set (data table).

source: Выходной набор данных Выходной набор данных — порт с измененными параметрами полей.
en: Output data set Output data set: the port with changed field features.

source: Выходной набор данных Выходной набор данных — результат слияния.
en: Output data set Output data set: join result.

source: Выходной набор данных Выходной набор данных — таблица данных.
en: Output data set Output data set: data table.

source: Выходной набор данных Выходной набор данных — таблица с присоединенными столбцами.
en: Output data set Output data set: table with joined columns.

source: Выходной набор данных Выходной набор данных — таблица, содержащая поля всех таблиц, поданных на входные порты, кроме полей присоединяемых таблиц, выбранных в качестве ключевых.
en: Output data set Output data set: the table that contains fields of all tables supplied to the input ports, with the exception of the joined tables fields selected as the key ones.

source: Выходной набор данных Выходной набор данных — таблица, содержащая поля всех таблиц, поданных на входные порты, кроме полей присоединяемых таблиц, выбранных в качестве сопоставляемых.
en: Output data set Output data set: the table that contains fields of all tables supplied to the input ports, with the exception of the joined tables fields selected as the mapped ones.

source: Выходной набор данных Таблица данных;
en: Output data set Data table;

source: Выходной набор
en: Output data set

source: Выходной порт таблицы Набор данных — Импортированные из хранилища данные.
en: Output port of table Data set: the data imported from the Data Warehouse.

source: Выходные переменные Выходные переменные — входные переменные и новые переменные, вычисленные обработчиком.
en: Output variables Output variables: input variables and new variables calculated by the handler.

source: Выходные переменные Выходные переменные — набор переменных;
en: Output variables Output variables: set of variables.

source: Выходные переменные Выходные переменные — новый набор переменных.
en: Output variables Output variables: the new set of variables.

source: Выходные переменные Выходные переменные — переменные после обработки.
en: Output variables Output variables: the variables after processing.

source: Выходные переменные Выходные переменные — список переменных, полученный из входного источника данных с использованием функций агрегации по полю.
en: Output variables Output variables: list of variables received from the input data source using aggregation functions by field.

source: Выходные переменные Переменные;
en: Output variables Variables;

source: Выходные — метки полей/переменных выходного набора порта.
en: Output: captions of the fields/variables of the output data set of the port.

source: Выходы Выходы Новый порт — создать новый порт выхода:
en: Outputs Outputs New port enable to create a new output port:

source: Вычисляемый факт
en: Calculated measure

source: Вычисляемый факт Вычисляемый факт
en: Calculated Measure Calculated Measure

source: Гельмерт — уникальные значения упорядочиваются, после чего каждое уникальное значение сравнивается со средним из последующих значений по таблице вида:
en: Helmert: the unique values are ordered, then each unique value is compared with the average value from the subsequent values according to the following table:

source: Генерировать составные метки полей – при наличии данного флага используется составная метка узла массива: в метках полей будет отражена иерархия относительно корневого элемента.
en: Generate composite field captions: if this checkbox has been selected, the composite array node caption is used. Hierarchy relative to the root element will be displayed in the field captions.

source: Генерировать составные метки полей — метка поля вывода элементов XML ответа сервиса содержит полный путь их расположения в иерархической структуре XML.
en: Generate composite field captions: the field caption used to display XML elements of the service response contains the full path of their location in the hierarchic XML structure.

source: Генерировать составные метки полей — при наличии данного флага в каждой метке поля будет отражена иерархия относительно корневого элемента.
en: Generate composite field captions: if this checkbox has been selected, hierarchy relative to the root element will be displayed in each field caption.

source: Гистограмма Гистограмма — операция, открывающая детализированное окно с расширенными настройками гистограммы.
en: Histogram Histogram: the operation that enables to open the detailed window with advanced histogram settings.

source: Гистограмма Гистограмма;
en: Histogram Histogram;

source: Главная таблица Главная таблица — в контексте понятий языка SQL-запросов является левой таблицей для соединения;
en: Main table Main table is the left table to be joined in the context of the SQL queries terms.

source: Главная таблица Главная таблица — первая таблица участвующая в объединении;
en: Main table Main table is the first table participating in the union.

source: Главная таблица Главная таблица — таблица, к которой добавляются наборы данных из присоединяемой таблицы (в контексте понятий языка SQL запросов принимает данные левой таблицы для соединения);
en: Main table Main table: the table to which data sets from the joined table are appended (in the context of the SQL terms, it accepts the left table data for join).

source: Главная
en: Home

source: Главное меню
en: Main menu

source: Главное меню — панель с кнопками для манипуляции с различными настройками;
en: Main menu: the panel designated for operations with different settings.

source: Главное окно визуализатора "Профили кластеров".
en: The main window of "Cluster profiles" visualizer.

source: Глубина истории — количество значений из предыдущих записей, для которых создаются новые поля в выходном наборе данных;
en: Depth period: number of values from the previous records for which the new fields are created in the output data set.

source: Глубина истории — количество отсчетов в "прошлое";
en: Depth period: lag count to the "past".

source: Глубина рекурсии — максимальное число рекурсий при раскрытии рекурсивных узлов.
en: Recursive depth provides the maximum number of recursions when opening recursive nodes.

source: Год.
en: Year.

source: Горизонт прогноза — количество значений из последующих записей, для которых создаются новые поля в выходном наборе данных.
en: Forecast horizon: number of values from the subsequent records for which the new fields are created in the output data set.

source: Горизонт прогноза — количество отсчетов в "будущее".
en: Forecast horizon: the lag count to the "future".

source: Группа значений — если в исходном поле с момента последней настройки узла появятся новые значения, то при включенном флаге Прочие факты для таких значений будут агрегироваться в столбце Прочие.
en: Group of values: if the new values appear in the source field from the moment of the last node configuration, in this case, with the enabled Other checkbox, measures for such values will be aggregated in the Other column.

source: Группа Группа — поля группировки.
en: Group Group: grouping fields.

source: Группа Группа — такое назначение выставляется автоматически при связывании полей групп.
en: Group Group: such usage type is automatically set when linking the group fields.

source: Группировать колонки — данный параметр работает при столбчатых диаграммах и позволяет располагать столбцы рядом друг с другом.
en: Group columns: this parameter is required for column charts and it enables to locate the columns near each other.

source: Группировка
en: Grouping

source: Группировка Группировка
en: Grouping Grouping

source: Групповая обработка — этот цикл разделяет исходные данные на группы по выбранному критерию, благодаря чему узел, заключенный в цикл, обрабатывает каждую группу данных отдельно.
en: Group processing: this loop divides the source data to the groups according to the selected criterion. Thus, the looped node processes each data group separately.

source: Да — сохранит и закроет данный Пакет.
en: Yes will save and close this Package.

source: Данные для расчета долей Данные для расчета долей — таблица, из которой считываются значения долей для разгруппировки.
en: Data for calculation of quotas Data for calculation of quotas: the table from which the values of ungrouping quotas are calculated.

source: Данные
en: Data

source: Дата и время
en: Date and time

source: Дата и время Дата и время
en: Date and Time Date and Time

source: Дата.
en: Date.

source: Дата/Время Дата/Время;
en: Date/Time Date/Time.

source: Дата — для ввода даты, будет вставлена конструкция создания объекта, содержащего текущую дату.
en: Date: to enter the date, the object creation construction containing the current date will be inserted.

source: Дата — для ввода даты, будет вставлено StrToDate("____-__-__", "YYYY-MM-DD");
en: Date: StrToDate("____-__-__", "YYYY-MM-DD") will be inserted to enter the date.

source: Действия контекстного меню элементов списка:
en: Actions of the list items context menu :

source: Действия панели инструментов раздела:
en: Actions of the section toolbar:

source: Денежный знак — позволяет добавить к отображаемому числу нужный знак.
en: Currency enables to add the required sign to the displayed digit.

source: Денормализировать коэффициенты модели — денормализация необходима для интерпретации результатов.
en: Denormalize model coefficients: denormalization is required for interpretation of results.

source: День.
en: Day.

source: Деревья данных
en: Data trees

source: Десятичный разделитель – символ, разделяющий дробную и целую части числовых значений.
en: Decimal separator: the character that separates fractional and integer parts of numeric expressions.

source: Десятичный разделитель — символ, разделяющий дробную и целую части числовых значений.
en: Decimal separator: the character that separates fractional and integer parts of numeric expressions.

source: Детализация
en: Detailing

source: Детализация Детализация — показать/скрыть Панель детализации.
en: Detailing Detailing: show/hide Detailing panel.

source: Детализация Детализация
en: Detailing Detailing

source: Детализированное окно гистограммы
en: Detailed histogram window

source: Детальные настройки.
en: Detailed settings.

source: Диаграмма WoE.
en: WoE chart.

source: Диаграмма Доля.
en: Rate Chart.

source: Диаграмма Количество.
en: Count Chart.

source: Диаграмма Куба
en: Cube Chart

source: Диаграмма начальных классов.
en: Fine classes chart.

source: Диаграмма Диаграмма
en: Chart Chart

source: Диаграммы WoE и IV.
en: WoE chart and chart IV.

source: Диапазон — диапазон импортируемых ячеек, заданных в формате [адрес верхней левой ячейки]:[адрес правой нижней ячейки].
en: Range: the range of the imported cells set in format [address of the upper left cell]:[address of the bottom right cell].

source: Дискретная гистограмма — представляет собой таблицу со следующими колонками:
en: Discrete histogram is a table with the following columns:

source: Дискретные данные — данные, число которых конечно или бесконечно, но может быть подсчитано при помощи натуральных чисел от одного до бесконечности.
en: Discrete data means the data the number of which is finite or infinite but it can be calculated using the natural numbers from one ad infinitum.

source: Для дерева данных — для дерева данных.
en: For data tree — for data tree.

source: Для переменных Переменные — для переменных.
en: For variables Variables — for variables.

source: Для переменных — для переменных.
en: For variables — for variables.

source: Для таблицы Таблица — для таблицы.
en: For table Table — for table.

source: Для таблицы — для таблицы.
en: For table — for table.

source: До первой пустой строки — строки будут импортированы до первой пустой строки.
en: To first blank row: rows will be imported up to the first blank row.

source: До последней строки — при выборе этой опции диапазон ячеек, заданный в параметре Диапазон, будет расширен до последней строки.
en: All rows: when selecting this option, the range of cells set in the Range parameter will be extended up to the last row.

source: Добавить ветвь Добавить — добавить новую ветвь условия;
en: Add branch Add enables to add a new condition branch.

source: Добавить выражение по образцу Добавить выражение по образцу — добавляет новое выражение с типом данных, описанием и формулой, как у текущего выражения;
en: Add expression by the example Add expression by the example enables to add a new expression with data type, description and formula similar to the current expression.

source: Добавить выражение Добавить выражение — добавляет новое выражение с параметрами по умолчанию;
en: Add expression Add expression enables to add a new expression with default parameters.

source: Добавить новое условие — добавить в ветвь новое условие, после нажатия открывается окно для его настройки:
en: Add new condition enables to add a new condition into the branch. Upon pressing, its configuration window will be opened:

source: Добавить порт Добавить еще один порт — создает новые порты входа для последующих присоединяемых таблиц, которые будут автоматически пронумерованы.
en: Add port Add another port enables to create new ports for the subsequent joined tables that will be automatically numbered.

source: Добавить факт
en: Add measure

source: Добавить факт Добавить факт
en: Add Measure Add Measure

source: Добавить Добавить — добавить нового пользователя;
en: Add Add: add a new user.

source: Добавить Добавить — добавить новую папку;
en: Add Add enables to add a new folder.

source: Добавить Добавить — позволяет добавить в список новую строку;
en: Add Add enables to add a new row to the list.

source: Добавление порта Добавление еще одного порта. Поскольку таблиц замен может быть несколько, то необходимые порты для них могут быть добавлены пользователем.
en: Add port Add another port. As several replacement tables are possible, the ports required for them can be added by a user.

source: Добавляемые переменные Добавляемые переменные — обязательный набор переменных;
en: Added variables Added variables: the required set of variables.

source: Добавлять идентификаторы итераций — флаг добавляет в выходную таблицу поле "Идентификатор итерации", где для каждой строки указан номер итерации, на которой строка была создана.
en: Add iteration identifiers: the checkbox enables to add the "Iteration identifier" field to the output table where the number of the iteration at which the row has been created is specified for each row.

source: Добавлять отступы и переводы строк — в результирующем XML каждый элемент располагается в отдельной строке.
en: Add indents and line breaks: each item is located in the separate row in the resulting XML.

source: Добавлять отступы и переводы строк — в файле экспорта каждой строке будет соответствовать один элемент, перед которым будет стоять позиция табуляции.
en: Add indents and line breaks: each line will correspond to one item before which tab stop will be placed in the export file.

source: Добавлять присоединяемые ключевые поля — установка этого флага оставит ключевые поля из присоединяемой таблицы в выходном наборе данных.
en: Add joined key fields: selection of this checkbox enables to keep the key fields from the joined table in the output data set.

source: Документация ClickHouse
en: ClickHouse Documents

source: Документация по SQL синтаксису
en: SQL Syntax Documentation.

source: Документация по SQL синтаксису.
en: SQL Syntax Documentation.

source: Документация по SQL синтаксису;
en: SQL Syntax Documentation;

source: Документация по продукции.
en: Product Documentation.

source: Доля — колонка с столбцами горизонтальной гистограммы.
en: Rate: the column with the horizontal histogram columns.

source: Дополнение данных
en: Enrich data;

source: Дополнение данных Дополнение данных
en: Enrich Data Enrich Data

source: Дополнение до наибольшего набора — предлагается выбрать один из вариантов дополнения наименьших по количеству записей таблиц:
en: Missing Terminal Rows Filling: it is required to select one of the options of filling of the table records least in number:

source: Дополнительные параметры.
en: Additional parameters.

source: Дополнительные.
en: Additional.

source: Дополнить таблицу данными — строки из таблицы-источника будут добавлены к выбранной таблице базы данных.
en: Append data to table enables to append rows from the source table to the selected database table.

source: Дополнять последней строчкой — дополнение копиями последней строки.
en: Repeat the last row: filling with the last row copies.

source: Допустимый процент пропусков — принимает значение в процентах и определяет порог, после которого заполнение пропусков не происходит.
en: Allowable percentage of nulls: it takes the value expressed in percentage terms and sets the threshold after which no imputation occurs.

source: Доступные поля — представляет список полей входного набора данных;
en: Available fields: list of fields of the input data set.

source: Доступные поля — содержит поля входного набора данных.
en: Available fields contain the input data set fields.

source: Доступные поля — содержит список полей входного набора данных.
en: Available fields contain a list of fields of the input data set.

source: Доступные элементы — левая часть, содержит список возможных для выбора элементов, соответствующих выбранному на предыдущем шаге объекту;
en: Available items are in the left part. It contains a list of items that can be chosen in accordance with the object selected at the previous stage.
